Revit 2026 API

# ConduitSizeIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ConduitSize Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As ConduitSize
	Get
```
```cpp
public:
virtual property ConduitSize^ Current {
	ConduitSize^ get ();
}
```
```fsharp
abstract Current : ConduitSize with get
override Current : ConduitSize with get
```

#### Property Value

ConduitSize

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ConduitSizeIterator Class

Autodesk.Revit.DB.Electrical Namespace